waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_rmu.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_rmu.h
  * @author  FMSH Application Team
  * @brief   Head file of RMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_RMU_H
#define __FM33FK5XX_FL_RMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_ES_INIT RMU Exported Init structures
  * @{
  */

/**
  * @brief FL RMU Init Sturcture definition
  */

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RMU_FL_Exported_Constants RMU Exported Constants
  * @{
  */

#define    RMU_BORCR_CFG_Pos                                      (2U)
#define    RMU_BORCR_CFG_Msk                                      (0x3U << RMU_BORCR_CFG_Pos)
#define    RMU_BORCR_CFG                                          RMU_BORCR_CFG_Msk

#define    RMU_BORCR_ENB_Pos                                      (0U)
#define    RMU_BORCR_ENB_Msk                                      (0x1U << RMU_BORCR_ENB_Pos)
#define    RMU_BORCR_ENB                                          RMU_BORCR_ENB_Msk

#define    RMU_RSTCFG_EN_Pos                                      (1U)
#define    RMU_RSTCFG_EN_Msk                                      (0x1U << RMU_RSTCFG_EN_Pos)
#define    RMU_RSTCFG_EN                                          RMU_RSTCFG_EN_Msk

#define    RMU_RSTFLAG_MAP_FLAG_Pos                               (13U)
#define    RMU_RSTFLAG_MAP_FLAG_Msk                               (0x1U << RMU_RSTFLAG_MAP_FLAG_Pos)
#define    RMU_RSTFLAG_MAP_FLAG                                   RMU_RSTFLAG_MAP_FLAG_Msk

#define    RMU_RSTFLAG_MDFN_FLAG_Pos                              (12U)
#define    RMU_RSTFLAG_MDFN_FLAG_Msk                              (0x1U << RMU_RSTFLAG_MDFN_FLAG_Pos)
#define    RMU_RSTFLAG_MDFN_FLAG                                  RMU_RSTFLAG_MDFN_FLAG_Msk

#define    RMU_RSTFLAG_NRSTN_FLAG_Pos                             (11U)
#define    RMU_RSTFLAG_NRSTN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_NRSTN_FLAG_Pos)
#define    RMU_RSTFLAG_NRSTN_FLAG                                 RMU_RSTFLAG_NRSTN_FLAG_Msk

#define    RMU_RSTFLAG_BORN_FLAG_Pos                              (9U)
#define    RMU_RSTFLAG_BORN_FLAG_Msk                              (0x1U << RMU_RSTFLAG_BORN_FLAG_Pos)
#define    RMU_RSTFLAG_BORN_FLAG                                  RMU_RSTFLAG_BORN_FLAG_Msk

#define    RMU_RSTFLAG_PORN_FLAG_Pos                              (8U)
#define    RMU_RSTFLAG_PORN_FLAG_Msk                              (0x1U << RMU_RSTFLAG_PORN_FLAG_Pos)
#define    RMU_RSTFLAG_PORN_FLAG                                  RMU_RSTFLAG_PORN_FLAG_Msk

#define    RMU_RSTFLAG_TESTN_FLAG_Pos                             (6U)
#define    RMU_RSTFLAG_TESTN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_TESTN_FLAG_Pos)
#define    RMU_RSTFLAG_TESTN_FLAG                                 RMU_RSTFLAG_TESTN_FLAG_Msk

#define    RMU_RSTFLAG_SOFTN_FLAG_Pos                             (5U)
#define    RMU_RSTFLAG_SOFTN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_SOFTN_FLAG_Pos)
#define    RMU_RSTFLAG_SOFTN_FLAG                                 RMU_RSTFLAG_SOFTN_FLAG_Msk

#define    RMU_RSTFLAG_IWDTN_FLAG_Pos                             (4U)
#define    RMU_RSTFLAG_IWDTN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_IWDTN_FLAG_Pos)
#define    RMU_RSTFLAG_IWDTN_FLAG                                 RMU_RSTFLAG_IWDTN_FLAG_Msk

#define    RMU_RSTFLAG_WWDTN_FLAG_Pos                             (2U)
#define    RMU_RSTFLAG_WWDTN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_WWDTN_FLAG_Pos)
#define    RMU_RSTFLAG_WWDTN_FLAG                                 RMU_RSTFLAG_WWDTN_FLAG_Msk

#define    RMU_RSTFLAG_LKUPN_FLAG_Pos                             (1U)
#define    RMU_RSTFLAG_LKUPN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_LKUPN_FLAG_Pos)
#define    RMU_RSTFLAG_LKUPN_FLAG                                 RMU_RSTFLAG_LKUPN_FLAG_Msk

#define    RMU_RSTFLAG_NVICN_FLAG_Pos                             (0U)
#define    RMU_RSTFLAG_NVICN_FLAG_Msk                             (0x1U << RMU_RSTFLAG_NVICN_FLAG_Pos)
#define    RMU_RSTFLAG_NVICN_FLAG                                 RMU_RSTFLAG_NVICN_FLAG_Msk

#define    PERHRSTEN_KEY                                          (0x13579BDFUL)
#define    SOFTWARERESET_KEY                                      (0x5C5CAABBUL)

#define    FL_RMU_RSTAHB_DMA                                      (0x1U << 0U)
#define    FL_RMU_RSTAHB_USB                                      (0x1U << 1U)
#define    FL_RMU_RSTAPB_UART5                                    (0x1fU << 0U)
#define    FL_RMU_RSTAPB_UART4                                    (0x1eU << 0U)
#define    FL_RMU_RSTAPB_UART3                                    (0x1dU << 0U)
#define    FL_RMU_RSTAPB_UART2                                    (0x1cU << 0U)
#define    FL_RMU_RSTAPB_UART1                                    (0x1bU << 0U)
#define    FL_RMU_RSTAPB_UART0                                    (0x1aU << 0U)
#define    FL_RMU_RSTAPB_UCIR                                     (0x19U << 0U)
#define    FL_RMU_RSTAPB_GPTIM2                                   (0x17U << 0U)
#define    FL_RMU_RSTAPB_GPTIM1                                   (0x16U << 0U)
#define    FL_RMU_RSTAPB_GPTIM0                                   (0x15U << 0U)
#define    FL_RMU_RSTAPB_BTIM16                                   (0x12U << 0U)
#define    FL_RMU_RSTAPB_UART7                                    (0x11U << 0U)
#define    FL_RMU_RSTAPB_UART6                                    (0x10U << 0U)
#define    FL_RMU_RSTAPB_SPI2                                     (0xfU << 0U)
#define    FL_RMU_RSTAPB_SPI1                                     (0xeU << 0U)
#define    FL_RMU_RSTAPB_SPI0                                     (0xdU << 0U)
#define    FL_RMU_RSTAPB_I2C1                                     (0xcU << 0U)
#define    FL_RMU_RSTAPB_I2C0                                     (0xbU << 0U)
#define    FL_RMU_RSTAPB_LPUART1                                  (0x9U << 0U)
#define    FL_RMU_RSTAPB_LPUART0                                  (0x8U << 0U)
#define    FL_RMU_RSTAPB_SPI4                                     (0x7U << 0U)
#define    FL_RMU_RSTAPB_SPI3                                     (0x6U << 0U)
#define    FL_RMU_RSTAPB_PGL                                      (0x5U << 0U)
#define    FL_RMU_RSTAPB_I2CSMB2                                  (0x4U << 0U)
#define    FL_RMU_RSTAPB_I2CSMB1                                  (0x3U << 0U)
#define    FL_RMU_RSTAPB_I2CSMB0                                  (0x2U << 0U)
#define    FL_RMU_RSTAPB_LPTIM16                                  (0x1U << 0U)
#define    FL_RMU_RSTAPB_OPA                                      (0x3aU << 0U)
#define    FL_RMU_RSTAPB_DAC                                      (0x39U << 0U)
#define    FL_RMU_RSTAPB_ADCCR                                    (0x38U << 0U)
#define    FL_RMU_RSTAPB_ADC                                      (0x37U << 0U)
#define    FL_RMU_RSTAPB_AES                                      (0x32U << 0U)
#define    FL_RMU_RSTAPB_CRC                                      (0x31U << 0U)
#define    FL_RMU_RSTAPB_RNG                                      (0x30U << 0U)
#define    FL_RMU_RSTAPB_EPWM3                                    (0x2fU << 0U)
#define    FL_RMU_RSTAPB_EPWM2                                    (0x2eU << 0U)
#define    FL_RMU_RSTAPB_EPWM1                                    (0x2dU << 0U)
#define    FL_RMU_RSTAPB_EPWM0                                    (0x2cU << 0U)
#define    FL_RMU_RSTAPB_EPSC                                     (0x29U << 0U)
#define    FL_RMU_RSTAPB_QSPI                                     (0x28U << 0U)
#define    FL_RMU_RSTAPB_CAN2                                     (0x27U << 0U)
#define    FL_RMU_RSTAPB_FDCAN                                    (0x26U << 0U)
#define    FL_RMU_RSTAPB_FSCAN                                    (0x25U << 0U)
#define    FL_RMU_RSTAPB_ATIM1                                    (0x23U << 0U)
#define    FL_RMU_RSTAPB_ATIM0                                    (0x22U << 0U)
#define    FL_RMU_RSTAPB_SVD                                      (0x21U << 0U)
#define    FL_RMU_RSTAPB_COMP                                     (0x20U << 0U)

